## Create Pandas Series

In [2]:
import pandas as pd

In [4]:
a = pd.Series([1,2,3,4,5])
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(a)

pandas.core.series.Series

In [7]:
a[4]

5

## Pandas dataframe

In [24]:
import numpy as np
temp = np.random.randint(low = 20, high = 100, size=(20,))
name = np.random.choice(['Sana','Sara','Maha'], 20)
randome = np.random.choice([10,12,13,14,15],20)

a = list(zip(temp, name, randome))

In [26]:
a

[(88, 'Sara', 13),
 (63, 'Sana', 12),
 (84, 'Sana', 10),
 (29, 'Sana', 14),
 (96, 'Sara', 14),
 (95, 'Sara', 12),
 (88, 'Sara', 13),
 (26, 'Sana', 12),
 (40, 'Maha', 10),
 (45, 'Sana', 15),
 (36, 'Sana', 10),
 (62, 'Sana', 15),
 (54, 'Maha', 10),
 (58, 'Sara', 12),
 (21, 'Sara', 14),
 (80, 'Sana', 10),
 (40, 'Sara', 15),
 (82, 'Sara', 15),
 (59, 'Sara', 10),
 (28, 'Sara', 12)]

In [30]:
df = pd.DataFrame(data= a, columns=('Temp', 'Names', 'Random'))
df

    Temp Names  Random
0     88  Sara      13
1     63  Sana      12
2     84  Sana      10
3     29  Sana      14
4     96  Sara      14
5     95  Sara      12
6     88  Sara      13
7     26  Sana      12
8     40  Maha      10
9     45  Sana      15
10    36  Sana      10
11    62  Sana      15
12    54  Maha      10
13    58  Sara      12
14    21  Sara      14
15    80  Sana      10
16    40  Sara      15
17    82  Sara      15
18    59  Sara      10
19    28  Sara      12

In [34]:
#creating a dataFrame as a dictionery

df = pd.DataFrame({'temp': temp, 'name': name, 'random': random})
type(df)

pandas.core.frame.DataFrame

In [35]:
df.head(3)

   temp  name  random
0    88  Sara      13
1    63  Sana      13
2    84  Sana      13

In [38]:
df.shape

(20, 3)

In [41]:
df['name'][5:11]

5     Sara
6     Sara
7     Sana
8     Maha
9     Sana
10    Sana
Name: name, dtype: object

In [44]:
df['temp'].describe()

count    20.000000
mean     58.700000
std      24.954907
min      21.000000
25%      39.000000
50%      58.500000
75%      82.500000
max      96.000000
Name: temp, dtype: float64

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
temp      20 non-null int32
name      20 non-null object
random    20 non-null int32
dtypes: int32(2), object(1)
memory usage: 400.0+ bytes

In [46]:
df.set_index('temp')

      name  random
temp
88    Sara      13
63    Sana      13
84    Sana      13
29    Sana      13
96    Sara      13
95    Sara      13
88    Sara      13
26    Sana      13
40    Maha      13
45    Sana      13
36    Sana      13
62    Sana      13
54    Maha      13
58    Sara      13
21    Sara      13
80    Sana      13
40    Sara      13
82    Sara      13
59    Sara      13
28    Sara      13

In [48]:
df.sort_index(axis=0)

    temp  name  random
0     88  Sara      13
1     63  Sana      13
2     84  Sana      13
3     29  Sana      13
4     96  Sara      13
5     95  Sara      13
6     88  Sara      13
7     26  Sana      13
8     40  Maha      13
9     45  Sana      13
10    36  Sana      13
11    62  Sana      13
12    54  Maha      13
13    58  Sara      13
14    21  Sara      13
15    80  Sana      13
16    40  Sara      13
17    82  Sara      13
18    59  Sara      13
19    28  Sara      13

## LOC and ILOC

In [2]:
df.iloc[0,1]

NameError: name 'df' is not defined